posts/wsl/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>wsl | chimez's blog</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/ipython.min.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/nikola_ipython.css" rel="stylesheet" type="text/css">
<link href="https://fonts.googleapis.com/css?family=Playfair+Display:700,900" rel="stylesheet">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" hreflang="en" href="../../rss.xml">
<link rel="canonical" href="https://chimez.github.io/posts/wsl/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="chimez">
<link rel="prev" href="../setuptools/" title="setuptools" type="text/html">
<meta property="og:site_name" content="chimez's blog">
<meta property="og:title" content="wsl">
<meta property="og:url" content="https://chimez.github.io/posts/wsl/">
<meta property="og:description" content="WSL



配置 ssh


安装 openssh-server

编辑 /etc/ssh/sshd_config


# change port
Port 9922
ListenAddress 0.0.0.0
PasswordAuthentication yes

重启服务器 sudo service ssh restart

windows 重定向端口


netsh interface p">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2021-10-21T12:27:51+08:00">
<meta property="article:tag" content="windows">
<meta property="article:tag" content="wsl">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Header and menu bar -->
<div class="container">
      <header class="blog-header py-3"><div class="row nbb-header align-items-center">
          <div class="col-md-3 col-xs-2 col-sm-2" style="width: auto;">
            <button class="navbar-toggler navbar-light bg-light nbb-navbar-toggler" type="button" data-toggle="collapse" data-target=".bs-nav-collapsible" aria-controls="bs-navbar" aria-expanded="false" aria-label="Toggle navigation">
                <span class="navbar-toggler-icon"></span>
            </button>
            <div class="collapse bs-nav-collapsible bootblog4-search-form-holder">
                
            </div>
        </div>
          <div class="col-md-6 col-xs-10 col-sm-10 bootblog4-brand" style="width: auto;">
            <a class="navbar-brand blog-header-logo text-dark" href="../../">

            <span id="blog-title">chimez's blog</span>
        </a>
          </div>
            <div class="col-md-3 justify-content-end align-items-center bs-nav-collapsible collapse flex-collapse bootblog4-right-nav">
            <nav class="navbar navbar-light bg-white"><ul class="navbar-nav bootblog4-right-nav">
<li class="nav-item">
    <a href="index.org" id="sourcelink" class="nav-link">Source</a>
    </li>


                    
            </ul></nav>
</div>
    </div>
</header><nav class="navbar navbar-expand-md navbar-light bg-white static-top"><div class="collapse navbar-collapse bs-nav-collapsible" id="bs-navbar">
            <ul class="navbar-nav nav-fill d-flex w-100">
<li class="nav-item">
<a href="../../archive.html" class="nav-link">Archive</a>
                </li>
<li class="nav-item">
<a href="../../categories/" class="nav-link">Tags</a>
                </li>
<li class="nav-item">
<a href="../../rss.xml" class="nav-link">RSS feed</a>

                
            </li>
</ul>
</div>
<!-- /.navbar-collapse -->
</nav>
</div>

<div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        
        
        
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">wsl</a></h1>

        <div class="metadata">
            <p class="byline author vcard p-author h-card"><span class="byline-name fn p-name" itemprop="author">
                    chimez
            </span></p>
            <p class="dateline">
            <a href="." rel="bookmark">
            <time class="published dt-published" datetime="2021-10-21T12:27:51+08:00" itemprop="datePublished" title="2021-10-21 12:27">2021-10-21 12:27</time></a>
            </p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-org663b7d0" class="outline-2">
<h2 id="org663b7d0">WSL</h2>
<div class="outline-text-2" id="text-org663b7d0">
</div>
<div id="outline-container-orgc3e453d" class="outline-3">
<h3 id="orgc3e453d">配置 ssh</h3>
<div class="outline-text-3" id="text-orgc3e453d">
<ol class="org-ol">
<li>安装 <code>openssh-server</code>
</li>
<li>
<p>
编辑 <code>/etc/ssh/sshd_config</code>
</p>
<pre class="example" id="orgaefff1f">
# change port
Port 9922
ListenAddress 0.0.0.0
PasswordAuthentication yes
</pre>
</li>
<li>重启服务器 <code>sudo service ssh restart</code>
</li>
<li>
<p>
windows 重定向端口
</p>
<pre class="example" id="orgee391ed">
netsh interface portproxy add v4tov4 listenaddress=0.0.0.0 listenport=9922 connectaddress=172.23.241.25 connectport=9922
</pre>
<ol class="org-ol">
<li>端口号就是 ssh 的</li>
<li>wsl 的 ip 地址可以从 <code>ifconfig</code> 命令获得</li>
<li>
<code>ifconfig</code> 在 <code>net-tools</code> 包中</li>
</ol>
</li>
<li>在 windows 防火墙中添加端口</li>
</ol>
</div>
</div>
</div>

    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../categories/windows/" rel="tag">windows</a></li>
            <li><a class="tag p-category" href="../../categories/wsl/" rel="tag">wsl</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../setuptools/" rel="prev" title="setuptools">Previous post</a>
            </li>
        </ul></nav></aside></article><!--End of body content--><footer id="footer">
            Contents © 2021         <a href="mailto:chimez@163.com">chimez</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
            
        </footer>
</div>
</div>


        <script src="../../assets/js/all-nocdn.js"></script><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element){var i=element.getElementsByTagName('img')[0];return i===undefined?'':i.alt;}});
    </script>
</body>
</html>

